damBreak-testfile/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.146;

vertices
(
    (0 0 0)
    (2 0 0)
    (2.16438 0 0)
    (4 0 0)
    (0 0.32876 0)
    (2 0.32876 0)
    (2.16438 0.32876 0)
    (4 0.32876 0)
    (0 4 0)
    (2 4 0)
    (2.16438 4 0)
    (4 4 0)
    (0 0 0.1)
    (2 0 0.1)
    (2.16438 0 0.1)
    (4 0 0.1)
    (0 0.32876 0.1)
    (2 0.32876 0.1)
    (2.16438 0.32876 0.1)
    (4 0.32876 0.1)
    (0 4 0.1)
    (2 4 0.1)
    (2.16438 4 0.1)
    (4 4 0.1)
    (0 3.67124 0)
    (2 3.67124 0)
    (2.16438 3.67124 0)
    (4 3.67124 0)
    (0 3.67124 0.1)
    (2 3.68124 0.1)
    (2.16438 3.67124 0.1)
    (4 3.67124 0.1)
);

blocks
(
    hex (0 1 5 4 12 13 17 16) (23 8 1) simpleGrading (1 1 1)
    hex (2 3 7 6 14 15 19 18) (19 8 1) simpleGrading (1 1 1)
    hex (4 5 25 24 16 17 29 28) (23 42 1) simpleGrading (1 1 1)
    hex (5 6 26 25 17 18 30 29) (4 42 1) simpleGrading (1 1 1)
    hex (6 7 27 26 18 19 31 30) (19 42 1) simpleGrading (1 1 1)
    hex (24 25 9 8 28 29 21 20) (23 8 1) simpleGrading (1 1 1)
    hex (26 27 11 10 30 31 23 22) (19 8 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    leftWall
    {
        type wall;
        faces
        (
            (0 12 16 4)
            (4 16 28 24)
            (24 28 20 8)
        );
    }
    rightWall
    {
        type wall;
        faces
        (
            (7 19 15 3)
	    (27 31 19 7)
            (11 23 31 27)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 1 13 12)
            (1 5 17 13)
            (5 6 18 17)
            (2 14 18 6)
            (2 3 15 14)
        );
    }
    upperWall
    {
	type wall;
	faces
	(
	    (8 9 21 20)
	    (9 21 29 25)
	    (9 21 22 10)
            (25 26 30 29)
            (26 30 22 10)
            (10 11 23 22)
	);
    }

    atmosphere
    {
        type patch;
        faces
        (
            (8 20 21 9)
            (9 21 22 10)
            (10 22 23 11)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
